app/views/users/my_items.html.erb

      <% if item.bought_by %>
        <td><%= User.find(item.bought_by).email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]