app/views/items/_item.html.erb

  <h3 class="card-title"><%= t('postedBy') %>: <%= item.user.email if item.user %></h3>
  <h3 class="card-title"><%= t('deliveredBy') %>: <%= User.find(item.delivered_by).email if item.delivered_by%></h3>
  <h3 class="card-title"><%= t('boughtBy') %>: <%= User.find(item.bought_by).email if item.bought_by%></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]