app/views/items/index.html.erb

      <% if item.bought_by %>
        <td><%= User.find(item.bought_by).email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]