app/views/items/without_delivery.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% if item.bought_by %>
        <td><%= User.find(item.bought_by).email %></td>