app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."delivered_by" IS NULL ORDER BY created_at DESC
---
  def without_delivery
    @items = Item.where(delivered_by: nil)

SELECT "items".* FROM "items" WHERE (title LIKE '%%') AND "items"."bought_by" IS NULL ORDER BY created_at DESC
---
  def without_buy
    @items = Item.where(bought_by: nil)

INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "asdas"], ["description", "asdasdasd"], ["created_at", "2018-04-25 19:11:43.501127"], ["updated_at", "2018-04-25 19:11:43.501127"], ["user_id", 1]]
---
  def create
    @item = Item.new(item_params)
    @item.user = current_user if signed_in?

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_file_name", "pexels-photo-46710.jpeg"], ["image_updated_at", "2018-04-26 20:07:15.603804"], ["updated_at", "2018-04-26 20:07:15.609432"], ["id", 5]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "delivered_by" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["delivered_by", nil], ["updated_at", "2018-06-16 14:34:29.344940"], ["id", 5]]
---
  def delivery
    redirect_to new_user_session_path and return unless current_user
    @item = Item.find(params[:id])
    unless @item.delivered_by
      @item.delivered_by = current_user.id if current_user
      @item.save!

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "delivered_by" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["delivered_by", 2], ["updated_at", "2018-06-16 14:44:03.212761"], ["id", 5]]
---
  def delivery_refuse
    @item = Item.find(params[:id])
    @item.delivered_by = nil if @item.delivered_by = current_user.id
    @item.save!

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "delivered_by" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["delivered_by", 2], ["updated_at", "2018-06-16 14:44:03.212761"], ["id", 5]]
---
  def buy
    redirect_to new_user_session_path and return unless current_user
    @item = Item.find(params[:id])
    unless @item.bought_by
      @item.bought_by = current_user.id if current_user
      @item.save!

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "bought_by" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["bought_by", nil], ["updated_at", "2018-06-16 15:14:07.110133"], ["id", 5]]
---
  def buy_refuse
    @item = Item.find(params[:id])
    @item.bought_by = nil if @item.bought_by = current_user.id
    @item.save!