app/controllers/users_controller.rb

  def delivery
    @items = Item.where(delivered_by: current_user.id) if current_user
---
SELECT "items".* FROM "items" WHERE "items"."delivered_by" = ?  [["delivered_by", 2]]

  def buy
    @items = Item.where(bought_by: current_user.id) if current_user
---
SELECT "items".* FROM "items" WHERE "items"."bought_by" = ?  [["bought_by", 2]]

  def profile
    update if params[:commit] == "Publish"
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]